{
    "products": [
        {
            "id": 1,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|Python",
            "title": "Python Practicando. Desde 0 hasta Desarrollador en Python",
            "shortDescription": "Aprende Python, donde iniciamos desde 0, sin conocimientos previos hasta desarrollar aplicaciones con mucha practica!",
            "description": "Python es Hoy uno de los lenguajes más utilizados por Excelencia. Esto se debe por su simpleza al momento de Desarrollar aplicaciones. Por su capacidad de procesamiento a altas velocidades con grandes volúmenes de información. Es un increíble lenguaje con el cual si no sabes programar, podrás aprender. En este curso te acompañare en el proceso por el cual aprenderás las bases del lenguaje, para luego determinar qué camino quieres seguir.",
            "price": 74.99,
            "discountPercentage": 0,
            "rating": 4.6,
            "students": 247858,
            "createdBy": "Avaro Chirou",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/2297910_788e_2.jpg"
        },
        {
            "id": 2,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|Python",
            "title": "Universidad Python con Frameworks Django, Flask, etc. +71hrs",
            "shortDescription": "De Cero a Experto en Python: PySide, Tkinter, POO, Web con Django, Flask, Jinja, SQL Alchemy, Postgresql y PyCharm!",
            "description": "Universidad Python con Frameworks: +71 horas de video y creciendo, y +154,600 alumnos inscritos al curso. Este es el mejor curso para aprender Python de Cero a Experto incluyendo los Frameworks de Django y Flask, con una calificación promedio de 4.7 (de 5 estrellas), una de las mejores calificaciones en cursos de Python. Aprenderás Python desde las bases, NO necesitas ningún tipo de experiencia programando, iremos avanzando desde lo más básico hasta llegar a niveles intermedios y avanzados, todo en este mismo curso, la Universidad Python.",
            "price": 74.99,
            "discountPercentage": 0,
            "rating": 4.6,
            "students": 194859,
            "createdBy": "Ing. Ubaldo Acosta",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/2867812_4227_14.jpg"
        },
        {
            "id": 3,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|ASP .NET",
            "title": "Curso Completo de Desarrollo ASP.NET MVC",
            "shortDescription": "Crea aplicaciones web fácilmente con .Net Framework",
            "description": "Este curso está dirigido para todos aquellos desarrolladores que están interesados en desarrollar las mejores aplicaciones web usando ASP.NET MVC de una forma más rápida y segura. Este curso proporciona un enfoque práctico con ejemplos paso a paso que le ayudarán a aprender y poner en práctica los conocimientos adquiridos.  ",
            "price": 64.99,
            "discountPercentage": 0,
            "rating": 4.6,
            "students": 7449,
            "createdBy": "Angel Arias",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/1209326_ca41_6.jpg"
        },
        {
            "id": 4,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|ASP .NET",
            "title": "React Native desde cero con Web API y Asp.Net MVC (C#)",
            "shortDescription": "Aprende a desarrollar aplicaciones móviles usando React Native y creando Web API usando Entity Framework",
            "description": "Bienvenidos al Curso de React Native donde aprenderemos a crear aplicaciones móviles de una manera rápida y sencilla. En este curso aprenderemos de CERO , sin necesidad de tener conocimientos previos. Nos conectaremos al motor de Base de datos SQL Server para crear nuestras PROPIAS APIs , publicarlo en un servidor y luego consumirlo desde nuestra aplicación  móvil. Aprenderemos a manejar textos , combos , fechas , manejo de imágenes , etc.",
            "price": 34.99,
            "discountPercentage": 0,
            "rating": 4.4,
            "students": 170,
            "createdBy": "Licito Hurol",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/3194714_636d_2.jpg"
        },
        {
            "id": 5,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|Java",
            "title": "Universidad Java - De Cero a Experto - Más Completo +106 hrs",
            "shortDescription": "El mejor curso de Java, POO, JDBC, Servlets, JavaEE, Web Services, JSF, EJB, JPA, PrimeFaces, Hibernate, Spring, Struts!",
            "description": "¡El Mejor y más completo curso de Java en todo Udemy! . Incluye +106 horas de video, +238,000 estudiantes, +38,000 reseñas de alumnos muy satisfechos. La Universidad Java es el mejor curso para aprender a programar en Java y en Español. Este curso es una especialización en la tecnología Java. Comenzaremos desde los Fundamentos de Java, y te llevaremos paso a paso hasta convertirte en un experto Java en tiempo record y así puedas crear aplicaciones Web y Empresariales, incluyendo temas y tecnologías como Fundamentos de Java, Programación Orientada a Objetos, Patrones de Diseño y Mejores prácticas Java, JDBC, HTML,CSS y JavaScript, HTML5 y CSS3, Servlets y JSP's, Java Empresarial (Java EE), incluyendo EJB's, JPA, Web Services, Seguridad, todo esto utilizando Maven, Log4j2, Angular con Java EE para crear aplicaciones Full Stack Java Developer, patrones de diseño, mejores prácticas, arquitecturas empresariales multicapa y mucho mucho más. ",
            "price": 74.99,
            "discountPercentage": 0,
            "rating": 4.7,
            "students": 242335,
            "createdBy": "Ubaldo Acosta",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/1265942_7e2f_27.jpg"
        },
        {
            "id": 6,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|Google Flutter",
            "title": "Flutter - Móvil: De cero a experto - Edición 2023 ",
            "shortDescription": "Riverpod, BLoC, push y local notifications, DDD, cámara, videos, JWT, go_router, material 3, App Stores y más",
            "description": "Este curso representa años de esfuerzo y estudio en Dart y Flutter sintetizados en más de 50 horas de video bajo demanda que van desde las bases del lenguaje Dart, hasta todo lo necesario para crear aplicaciones en Flutter funcionales y atractivas visualmente. El curso no sólo pretende enseñarte Dart y Flutter, sino que aprendas a crear aplicaciones reales siguiendo el Doman Driven Design, una forma de programar y estructurar proyectos que nos permitan hacer aplicaciones fáciles de expandir y mantener, pasando por Clean Code y varios patrones que te ayudarán a que estés orgulloso del código que escribes.",
            "price": 199.99,
            "discountPercentage": 0,
            "rating": 4.6,
            "students": 8370,
            "createdBy": "Fernando Herrera",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/5132066_04b4_3.jpg"
        },
        {
            "id": 7,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|Angular",
            "title": "Angular: De cero a experto - Edición 2023",
            "shortDescription": "Signals, componentes, directivas, servicios, mapas,, JWT, autenticación, despliegues, mongo, Git, GitHub y mucho más",
            "description": "Angular es un framework para desarrollo de aplicaciones de todo tipo, por defecto genera aplicaciones web muy poderosas y robustas, y si se mezcla con otras tecnologías, puedes hacer aplicaciones móviles y de escritorio también con el mismo código. Este curso te ayudará a aprender Angular (la última versión) a profundidad mediante ejercicios y tareas que tú mismo harás. Partiendo de cero conocimiento de TypeScript hasta crear un sistema robusto de autenticación, uso de mapas, consumo de servicios y mucho más",
            "price": 199.99,
            "discountPercentage": 0,
            "rating": 4.8,
            "students": 45142,
            "createdBy": "Fernando Herrera",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/3662358_4d6e_2.jpg"
        },
        {
            "id": 8,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|Laravel",
            "title": "Aprende Laravel paso a paso desde cero - De 0 a 100",
            "shortDescription": "Domina Laravel y Crea Aplicaciones de Alto Rendimiento con Laravel",
            "description": "Laravel es un framework de código abierto para desarrollar aplicaciones y servicios web con PHP 5, PHP 7 y PHP 8. Su filosofía es desarrollar código PHP de forma elegante y simple, evitando el 'código espagueti'. Fue creado en 2011 y tiene una gran influencia de frameworks como Ruby on Rails, Sinatra y ASP.NET MVC.Laravel ofrece utilidades que simplifican la creación de aplicaciones web, agilizando significativamente este proceso y generando un código organizado y manejable. Gracias a esta característica, la popularidad de Laravel ha experimentado un rápido crecimiento en los últimos tiempos, atrayendo a numerosos desarrolladores que lo eligen como su framework preferido para alcanzar una eficiente metodología de desarrollo.",
            "price": 19.99,
            "discountPercentage": 0,
            "rating": 4.0,
            "students": 10014,
            "createdBy": "Luis Orlando Muñoz Bueno",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/5379310_1d18.jpg"
        },
        {
            "id": 9,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|React",
            "title": "React: De cero a experto ( Hooks y MERN )",
            "shortDescription": "Context API, MERN, Hooks, Firestore, JWT, Testing, Autenticaciones, Despliegues, CRUD, Logs, MUI, Multiple Routers...",
            "description": "Este curso tiene por objetivo llevarte de cero conocimiento de React hasta un nivel competitivo en el ambiente laboral de hoy en día. Este curso está construido 100% en Hooks y functional components.También cuenta con secciones sobre pruebas unitarias y de integración en cada aplicación que hacemos en el curso, esto incluye pruebas en componentes, hooks, customHooks, context, Redux, Fetch, mocks, spies, snapshots y mucho más relacionado al unit test. Sin olvidar que todos empezamos de cero en un momento, el curso cuenta con una introducción a los conceptos que necesitaremos para entrar en React de la forma más cómoda posible.",
            "price": 199.99,
            "discountPercentage": 0,
            "rating": 4.9,
            "students": 67719,
            "createdBy": "Fernando Herrera",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/3096364_6113_3.jpg"
        },
        {
            "id": 10,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|Doocker",
            "title": "Docker - Guía práctica de uso para desarrolladores",
            "shortDescription": "Dockerfile, Compose, DockerHub, Registros, Despliegues, Volúmenes, Multi-staged builds, Multi architecture builds, y más",
            "description": "Docker es una plataforma de software de código abierto para automatizar despliegues de aplicaciones dentro de contenedores, y proporciona una forma eficaz de controlar versiones, agilizar el desarrollo y es una pieza fundamental para Kubernetes. Poder crear, usar, y desplegar imágenes es una habilidad necesaria para cualquier desarrollador o administrador de hoy en día, ahorra mucho tiempo en la preparación de diferentes ambientes de desarrollo, testing, staging y production. Este curso te dará las más que las bases para poder utilizar Docker de una forma productiva y funcional, aprenderemos mediante ejercicios prácticos y tareas. También cuenta con una sección introductoria a Kubernetes (K8s) para que adicionalmente puedas seguir explorando todo lo que el mundo de los contenedores ofrece.",
            "price": 199.99,
            "discountPercentage": 0,
            "rating": 4.9,
            "students": 67118,
            "createdBy": "Fernando Herrera",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/5010670_1ac1.jpg"
        },
        {
            "id": 11,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|NodeJs",
            "title": "Node: De cero a experto (Legacy)",
            "shortDescription": "Rest, despliegues, Heroku, Mongo, Git, GitHub, Sockets, archivos, JWT y mucho más para ser un experto en Node",
            "description": "Node debe de ser una herramienta que debes de conocer hoy en día, su popularidad y uso va creciendo cada día más y debemos de estar preparados para implementar todas sus bondades para el beneficio de nuestros proyectos o trabajo, para poder crear aplicaciones modernas escalables que nos permitirán estar siempre a la vanguardia con la tecnología. Espero que te enroles al curso lo antes posible para que Node se vuelva parte de tu conocimiento como un desarrollador de nivel mundial.",
            "price": 199.99,
            "discountPercentage": 0,
            "rating": 4.9,
            "students": 65111,
            "createdBy": "Fernando Herrera",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/1562070_d426_3.jpg"
        },
        {
            "id": 12,
            "category": "Desarrollo",
            "subCategory": "Lenguajes de programacion|NextJs",
            "title": "Next.js: El framework de React para producción",
            "shortDescription": "SSR, SSG, CSR, ISR, Middlewares, Rutas dinámicas, Next API, Next Auth, Material UI, despliegues, Cookies y más.",
            "description": "Next.js te brinda una excelente experiencia de desarrollo con todas las funciones que necesita para la producción: renderizado híbrido estático y de servidor, compatibilidad con TypeScript, agrupación inteligente, precarga de rutas y más. Este curso está enfocado para las personas con conocimiento básico de React que desean aprender Next.js de forma completa e ir más allá.",
            "price": 199.99,
            "discountPercentage": 0,
            "rating": 4.8,
            "students": 13542,
            "createdBy": "Fernando Herrera",
            "language": "Español",
            "thumbnail": "https://img-c.udemycdn.com/course/240x135/4510678_1844_2.jpg"
        }
    ]
}